/********************************************************************************
*
* 文件名  ： uart.h
* 负责人  ： 彭鹏(pengpeng@fiberhome.com)
* 创建日期： 20160624
* 版本号  ： v1.0
* 文件描述： stm32f4 hal驱动封装
* 版权说明： Copyright (c) 2000-2020 GNU
* 其 他   ： 无
* 修改日志： 无
*
********************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _UART_H_
#define _UART_H_

/************************************ 头文件 ***********************************/
#include "typedef.h"
#include "stm32f4xx_hal.h"
#include "config.h"

/************************************ 宏定义 ***********************************/
/*********************************** 类型定义 **********************************/
typedef struct drv_uart_T_tag{
    UART_HandleTypeDef  handle;     /* stm32 halt uart句柄 */
    USART_TypeDef      *reg_base;   /* 处理器uart 寄存器地址句柄 */
    int32_T             baud_rate;  /* 波特率 */	

    __IO bool_T         dma_tc_lock;/* dma 传输完成 锁定 */
}drv_uart_T;

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
void uart_init(drv_uart_T *uart);
void uart_send(drv_uart_T *uart, uint8_T *fmt, ...);
void uart_tc_unlock(drv_uart_T *uart);

#endif

