/********************************************************************************
*
* 文件名  ： misc.h
* 负责人  ： 彭鹏(pengpeng@fiberhome.com)
* 创建日期： 20150614
* 版本号  ： v1.0
* 文件描述： 杂项函数接口
* 版权说明： Copyright (c) 2000-2020 GNU
* 其 他   ： 无
* 修改日志： 无
*
********************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _MISC_H_
#define _MISC_H_

/************************************ 头文件 ***********************************/
#include "config.h"
#include "typedef.h"
#include "string.h"

/************************************ 宏定义 ***********************************/

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
void assert_failed(unsigned char* file, unsigned int line);
void err_loop(void);
void get_now(uint32_T *ms, uint32_T *clk);
void diff_clk(uint32_T *ms, uint32_T *clk, uint32_T ms1, uint32_T clk1, uint32_T ms2, uint32_T clk2);

#endif

