/********************************************************************************
*
* 文件名  ： imu.h
* 负责人  ： 彭鹏(pengpeng@fiberhome.com)
* 创建日期： 20160112
* 版本号  ： v1.0
* 文件描述： imu(i2c) 驱动头文件
* 版权说明： Copyright (c) 2000-2020 GNU
* 其 他   ： 无
* 修改日志： 无
*
********************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _IMU_H_
#define _IMU_H_

/************************************ 头文件 ***********************************/
#include "config.h"
#include "data.h"

/************************************ 宏定义 ***********************************/
#define A_BUF_WRITING       (0)
#define B_BUF_WRITING       (1)

/*********************************** 类型定义 **********************************/
/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
void imu_init(void);

void imu_read_poll(uint8_T dev_addr, uint16_T reg_offset, uint8_T *buf, uint32_T n);
void imu_write_poll(uint8_T dev_addr, uint16_T reg_offset, const uint8_T *buf, uint32_T n);

/* systick 中调用触发读 */
void imu_start(void);
void imu_stop(void);
void imu_read_in_systick(void);

/* 融合算法读取缓存 */
void imu_init_done_wait(void); /* 等待缓冲好第一面缓存 */
uint32_T imu_read_buf(data_T **data, uint32_T n);

#endif

